app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM "orders"

  def create
    @order = Order.new(params[:order])
    if @order.save
---
INSERT INTO "orders" ("customer_name", "updated_at", "created_at") VALUES('Big Bob', '2009-11-24 06:13:00', '2009-11-24 06:13:00')

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)

  def update
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 4)

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)
DELETE FROM "orders" WHERE "id" = 1